[
  {
    "id": 1,
    "name": "Chicken",
    "scale":  "0.6",
    "rotation": "90",
    "part1_vector": "-0.6,-2,0",
    "part2_vector": "-0.6,-1.5,0",
    "part3_vector": "-1.5,0.2,0",
    "part1_rotation": "60,-180,0",
    "part2_rotation": "0,90,0",
    "part3_rotation":  "15,0,0",
    "modelpath": "/Chicken/cock",
    "introduction": "Chickens are domestic or farm birds. The male chicken is called a rooster, the female is called a hen, and the young are called chicks. The sound you hear every morning is the rooster crowing cock a doodle doo.",
    "info1": "Comb - Comb is a small ice of meat above the head of the chicken. We can differentiate rooster and hen by their comb. The male has a larger comb compared to the female.",
    "info2": "Wings - Chicken have a set of wing feathers on either side of the body which allow them to fly.",
    "info3": "Vent - Closet and eggs of chicken come out from the vent of chicken. Sperm also come out from the vent of chicken.",
    "type": "landAnimals"
  },
  {
    "id": 2,
    "name": "Cat",
    "scale": "0.01",
    "rotation": "-180",
    "part1_vector": "-0.6,-1,0",
    "part2_vector": "-0.6,-1,0",
    "part3_vector": "-0.6,0.2,0",
    "part1_rotation": "0,-90,0",
    "part2_rotation": "0,90,0",
    "part3_rotation":  "0,-90,0",
    "modelpath": "/Cat/cat",
    "introduction": "Cats are one of the most popular pets of the world. They can sleep 13 to 14 hours a day. They can jump approximately seven times their height. They have powerful night vision. They also have excellent hearing and powerful sense of smell. Cats tongue contains small hooks which they can use to lick themselves to make it clean. A cat has 230 bones, even more than a human.",
    "info1": "Head - Cats cannot see in total darkness, but they see well in very low light. They are not completely colorblind, but their color vision is limited.",
    "info2": "Tail - The flexible tail helps a cat keep its balance. When a cat falls, it whips the tail and twists its body to land on its feet.",
    "info3": "Paws - Cats use their paws to clean those hard to reach areas behind ears, under chins, on necks and faces. Cats also use their paws to mark territories. Together with the claw, the paw helps them in climbing trees.",
    "type": "landAnimals"
  },
  {
    "id": 3,
    "name": "Bird",
    "scale": "0.01",
    "rotation": "180",
    "part1_vector": "-1,-0.5,0",
    "part2_vector": "-1,-1,0",
    "part3_vector": "-2.3,0.2,0",
    "part1_rotation": "0,-90,60",
    "part2_rotation": "0,90,0",
    "part3_rotation": "0,180,0",
    "modelpath": "/Bird/model",
    "introduction": "Birds are vertebrates. Birds vary in sizes. All modern birds have wings, feathers, and beaks. Birds are animal with feathers. However, not all birds can fly. Some birds, like ostriches can run and penguins can swim.",
    "info1": "Head - Its head is where the field marks are seen such as eye color, eyebrows, eye rings, eye lines and auricular patches.",
    "info2": "Tail - The length, shape and colors of a bird's tail are important for proper identification.",
    "info3": "Wings - Birds flap their wings and push more and more air down which help them to fly.",
    "type": "airAnimals"
  },
  {
    "id": 4,
    "name": "Tiger",
    "scale": "0.5",
    "rotation": "90",
    "part1_vector": "-1,-1,0",
    "part2_vector": "-1,-1,0",
    "part3_vector": "-0.3,0.2,0",
    "part1_rotation": "35,180,0",
    "part2_rotation": "0,90,0",
    "part3_rotation": "0,180,0",
    "modelpath": "/Tiger/tiger_idle",
    "introduction": "The tiger is the largest cat species, most recognizable for their pattern of dark vertical stripes on reddish orange fur with a lighter underside. Tiger is one of only a few striped cat species, and those stripes are still visible even when it is shaved.",
    "info1": "Head - Tigers see 6 times better than humans at night. Its sense of smell is one of the few that does not contribute to its success in terms of hunting because it has a small olfactory region in its brain and has few smell detecting cells.",
    "info2": "Fur & Legs - Tiger has reddish orange fur with a lighter underside. Its hind legs are longer than its front legs, giving them the ability to leap forward 20 to 30 feet in one jump.",
    "info3": "Paw & Claws - The Tiger has a paw print is called pugmark. Tigers have sharp and retractable claws. They used them for the killing of the prey and for a fight with other tigers.",
    "type": "landAnimals"
  },
  {
    "id": 5,
    "name": "Elephant",
    "scale": "0.2",
    "rotation": "0",
    "part1_vector": "-1,-1,0",
    "part2_vector": "-2,-1,0",
    "part3_vector": "-1,0.2,0",
    "part1_rotation": "0,90,0",
    "part2_rotation": "0,180,0",
    "part3_rotation":  "0,180,0",
    "modelpath": "/Elephant/Elephant",
    "introduction": "The elephant is the largest land animals on Earth. They have characteristic long nose or trunks, large floppy ears, and wide thick legs. The elephant’s skin helps to disperse an elephant’s body heat, cooling the animal. Elephants have evolved many folds in their skin layers, giving them their baggy and wrinkled appearance.",
    "info1": "Trunk - The elephant trunk is the fusion of the nose and the upper lip, it is used for breathing, smelling, touching, grasping, and producing sound.",
    "info2": "Ears - Elephant uses its ears to cool down. They also used it to express excitement and enjoyment by flopping their ears.",
    "info3": "Legs - The elephant has two elbows and two knees (quadrupeds). The forefeet of an elephant have a circular shape whereas the back feet are a more oval shape.",
    "type": "landAnimals"
  }
]